ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
#include "foc_platform.h"
#include "foc_math_accel.h"

static foc_platform_config_t g_foc_platform_config =
{
    sizeof(foc_platform_config_t),
    FOC_PLATFORM_CONFIG_VERSION,
    7.0f,
    18.0f,
    1.15f,
    0.03f,
    0.97f,
    FOC_DEFAULT_ISR_DEADLINE_CYCLES,
};

#if defined(FOC_TARGET_STM32G431)
#include "stm32g4xx_hal.h"

/* ST reference: NUCLEO-G431RB + X-NUCLEO-IHM16M1. */
#define FOC_GATE_ENABLE_PORT             GPIOB
#define FOC_GATE_ENABLE_PINS             (GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15)
#define FOC_PWM_PORT                     GPIOA
#define FOC_PWM_PINS                     (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10)
#define FOC_DRIVER_PROTECTION_PORT       GPIOA
#define FOC_DRIVER_PROTECTION_PIN        GPIO_PIN_11

#define FOC_PWM_TIMER_CLOCK_HZ           (170000000UL)
#define FOC_PWM_FREQUENCY_HZ             (12000UL)
#define FOC_PWM_PERIOD_TICKS             (FOC_PWM_TIMER_CLOCK_HZ / (2UL * FOC_PWM_FREQUENCY_HZ))
#define FOC_ADC_FULL_SCALE               (4095.0f)
#define FOC_ADC_REFERENCE_VOLTAGE        (3.3f)
#define FOC_BUS_PARTITIONING_FACTOR      (0.0625f)
#define FOC_CURRENT_SHUNT_OHM            (0.33f)
#define FOC_CURRENT_AMPLIFIER_GAIN       (1.53f)
#define FOC_ADC_TIMEOUT_MS               (5UL)
#define FOC_OFFSET_SAMPLE_COUNT          (32UL)
#define FOC_OFFSET_MIN_VALID             (256U)
#define FOC_OFFSET_MAX_VALID             (3839U)
#define FOC_CURRENT_COUNTS_PER_AMP       ((FOC_ADC_FULL_SCALE * FOC_CURRENT_SHUNT_OHM * \
                                           FOC_CURRENT_AMPLIFIER_GAIN) / \
                                          FOC_ADC_REFERENCE_VOLTAGE)
#define FOC_TRACE_CAPACITY               (64U)
#define FOC_TRACE_MIN_DIVIDER            (120U)
#define FOC_TRIAL_REQUIRED_FLAGS          (FOC_PLATFORM_DIAG_TIM1_CONFIGURED | \
                                           FOC_PLATFORM_DIAG_ADC_CONFIGURED | \
                                           FOC_PLATFORM_DIAG_ADC_CALIBRATED | \
                                           FOC_PLATFORM_DIAG_CURRENT_OFFSETS_VALID | \
                                           FOC_PLATFORM_DIAG_SYNC_RUNNING | \
                                           FOC_PLATFORM_DIAG_SYNC_SAMPLES_VALID)
#define FOC_TRIAL_FORBIDDEN_FLAGS         (FOC_PLATFORM_DIAG_DRIVER_FAULT | \
                                           FOC_PLATFORM_DIAG_OUTPUT_ACTIVE | \
                                           FOC_PLATFORM_DIAG_ADC_READ_ERROR | \
                                           FOC_PLATFORM_DIAG_BREAK_LATCHED | \
                                           FOC_PLATFORM_DIAG_CURRENT_TRIP | \
                                           FOC_PLATFORM_DIAG_TRIAL_ARMED)

static TIM_HandleTypeDef g_foc_tim1;
static ADC_HandleTypeDef g_foc_adc1;
static ADC_HandleTypeDef g_foc_adc2;
static volatile foc_platform_diagnostics_t g_foc_diagnostics;
static volatile uint32_t g_foc_control_armed;
static foc_rust_context_t *g_foc_controller;
static volatile foc_telemetry_t g_foc_telemetry;
static volatile foc_trace_sample_t g_foc_trace_buffer[FOC_TRACE_CAPACITY];
static volatile uint32_t g_foc_trace_head;
static volatile uint32_t g_foc_trace_tail;
static volatile uint32_t g_foc_trace_enabled;
static volatile uint32_t g_foc_trace_divider = 240U;
static volatile uint32_t g_foc_trace_counter;
static volatile uint32_t g_foc_trace_dropped_count;

static int16_t foc_trace_scaled_i16(float value, float scale)
{
    float scaled = value * scale;
    if (scaled > 32767.0f)
    {
        return 32767;
    }
    if (scaled < -32768.0f)
    {
        return -32768;
    }
    return (int16_t)(scaled + ((scaled >= 0.0f) ? 0.5f : -0.5f));
}

static uint16_t foc_trace_scaled_u16(float value, float scale)
{
    float scaled = value * scale;
    if (scaled <= 0.0f)
    {
        return 0U;
    }
    if (scaled >= 65535.0f)
    {
        return 65535U;
    }
    return (uint16_t)(scaled + 0.5f);
}

static void foc_platform_trace_capture(const foc_feedback_t *feedback,
                                       const foc_output_t *output,
                                       const foc_telemetry_t *telemetry)
{
    foc_trace_sample_t sample;
    uint32_t head;
    uint32_t next;

    if (g_foc_trace_enabled == 0U)
    {
        return;
    }
    ++g_foc_trace_counter;
    if (g_foc_trace_counter < g_foc_trace_divider)
    {
        return;
    }
    g_foc_trace_counter = 0U;

    sample.step = g_foc_diagnostics.realtime_step_count;
    sample.flags = g_foc_diagnostics.flags;
    sample.state = (uint16_t)telemetry->state;
    sample.observer_reliable = (uint16_t)telemetry->observer_reliable;
    sample.phase_a_ma = foc_trace_scaled_i16(feedback->phase_current_a, 1000.0f);
    sample.phase_b_ma = foc_trace_scaled_i16(feedback->phase_current_b, 1000.0f);
    sample.phase_c_ma = foc_trace_scaled_i16(feedback->phase_current_c, 1000.0f);
    sample.id_reference_ma = foc_trace_scaled_i16(telemetry->id_reference_a, 1000.0f);
    sample.iq_reference_ma = foc_trace_scaled_i16(telemetry->iq_reference_a, 1000.0f);
    sample.id_measured_ma = foc_trace_scaled_i16(telemetry->id_measured_a, 1000.0f);
    sample.iq_measured_ma = foc_trace_scaled_i16(telemetry->iq_measured_a, 1000.0f);
    sample.vd_command_mv = foc_trace_scaled_i16(telemetry->vd_command_v, 1000.0f);
    sample.vq_command_mv = foc_trace_scaled_i16(telemetry->vq_command_v, 1000.0f);
    sample.duty_a_per_mille = foc_trace_scaled_u16(output->duty_a, 1000.0f);
    sample.duty_b_per_mille = foc_trace_scaled_u16(output->duty_b, 1000.0f);
    sample.duty_c_per_mille = foc_trace_scaled_u16(output->duty_c, 1000.0f);
    sample.bus_voltage_mv = foc_trace_scaled_u16(feedback->dc_bus_voltage, 1000.0f);
    sample.control_angle_mrad =
        foc_trace_scaled_i16(telemetry->electrical_angle_rad, 1000.0f);
    sample.forced_angle_mrad =
        foc_trace_scaled_i16(telemetry->forced_electrical_angle_rad, 1000.0f);
    sample.observer_angle_mrad =
        foc_trace_scaled_i16(telemetry->observer_electrical_angle_rad, 1000.0f);
    sample.observer_speed_rpm =
        foc_trace_scaled_i16(telemetry->measured_speed_rpm, 1.0f);

