ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
    head = g_foc_trace_head;
    next = (head + 1U) & (FOC_TRACE_CAPACITY - 1U);
    if (next == g_foc_trace_tail)
    {
        ++g_foc_trace_dropped_count;
        return;
    }
    g_foc_trace_buffer[head] = sample;
    __DMB();
    g_foc_trace_head = next;
}

static uint16_t foc_platform_current_trip_counts(void)
{
    float counts = g_foc_platform_config.software_current_trip_a *
                   FOC_CURRENT_COUNTS_PER_AMP;
    if (counts < 1.0f)
    {
        counts = 1.0f;
    }
    if (counts > 32767.0f)
    {
        counts = 32767.0f;
    }
    return (uint16_t)(counts + 0.5f);
}

static uint16_t foc_platform_bus_voltage_to_raw(float voltage_v)
{
    float raw = (voltage_v * FOC_ADC_FULL_SCALE * FOC_BUS_PARTITIONING_FACTOR) /
                FOC_ADC_REFERENCE_VOLTAGE;
    if (raw < 0.0f)
    {
        raw = 0.0f;
    }
    if (raw > FOC_ADC_FULL_SCALE)
    {
        raw = FOC_ADC_FULL_SCALE;
    }
    return (uint16_t)(raw + 0.5f);
}

static void foc_platform_disable_power_fast(void)
{
    FOC_GATE_ENABLE_PORT->BSRR = ((uint32_t)FOC_GATE_ENABLE_PINS << 16U);
    if ((RCC->APB2ENR & RCC_APB2ENR_TIM1EN) != 0U)
    {
        TIM1->BDTR &= ~TIM_BDTR_MOE;
        TIM1->CCER &= ~(TIM_CCER_CC1E | TIM_CCER_CC2E | TIM_CCER_CC3E);
        TIM1->CCR1 = 0U;
        TIM1->CCR2 = 0U;
        TIM1->CCR3 = 0U;
    }
    g_foc_control_armed = 0U;
    g_foc_diagnostics.flags &= ~(FOC_PLATFORM_DIAG_TRIAL_ARMED |
                                 FOC_PLATFORM_DIAG_REALTIME_ARMED);
}

static uint32_t foc_platform_gate_is_low(void)
{
    return ((FOC_GATE_ENABLE_PORT->ODR & FOC_GATE_ENABLE_PINS) == 0U) ? 1U : 0U;
}

static uint32_t foc_platform_driver_faulted(void)
{
    /* IHM16M1 driver-protection input is active low and has a pull-up. */
    return ((FOC_DRIVER_PROTECTION_PORT->IDR & FOC_DRIVER_PROTECTION_PIN) == 0U) ? 1U : 0U;
}

static void foc_platform_refresh_safety_flags(void)
{
    uint32_t outputs_active = 0U;
    uint32_t timer_safe = 1U;

    g_foc_diagnostics.flags &= ~(FOC_PLATFORM_DIAG_GATE_SAFE |
                                 FOC_PLATFORM_DIAG_DRIVER_FAULT |
                                 FOC_PLATFORM_DIAG_OUTPUT_ACTIVE);

    if ((RCC->APB2ENR & RCC_APB2ENR_TIM1EN) != 0U)
    {
        outputs_active = (((TIM1->BDTR & TIM_BDTR_MOE) != 0U) ||
                          ((TIM1->CCER & (TIM_CCER_CC1E | TIM_CCER_CC2E |
                                         TIM_CCER_CC3E)) != 0U)) ? 1U : 0U;
        timer_safe = (outputs_active == 0U) ? 1U : 0U;
    }

    if ((foc_platform_gate_is_low() != 0U) && (timer_safe != 0U))
    {
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_GATE_SAFE;
    }
    if (foc_platform_driver_faulted() != 0U)
    {
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_DRIVER_FAULT;
    }
    if ((foc_platform_gate_is_low() == 0U) || (outputs_active != 0U))
    {
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_OUTPUT_ACTIVE;
    }
}

static uint32_t foc_platform_init_timer_disabled(void)
{
    GPIO_InitTypeDef gpio = {0};
    TIM_MasterConfigTypeDef master = {0};
    TIMEx_BreakInputConfigTypeDef break_input = {0};
    TIM_OC_InitTypeDef output = {0};
    TIM_BreakDeadTimeConfigTypeDef break_dead_time = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_TIM1_FORCE_RESET();
    __HAL_RCC_TIM1_RELEASE_RESET();

    gpio.Pin = FOC_DRIVER_PROTECTION_PIN;
    gpio.Mode = GPIO_MODE_AF_OD;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    gpio.Alternate = GPIO_AF12_TIM1_COMP1;
    HAL_GPIO_Init(FOC_DRIVER_PROTECTION_PORT, &gpio);

    gpio.Pin = FOC_PWM_PINS;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLDOWN;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF6_TIM1;
    HAL_GPIO_Init(FOC_PWM_PORT, &gpio);

    g_foc_tim1.Instance = TIM1;
    g_foc_tim1.Init.Prescaler = 0U;
    g_foc_tim1.Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED1;
    g_foc_tim1.Init.Period = FOC_PWM_PERIOD_TICKS;
    g_foc_tim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV2;
    g_foc_tim1.Init.RepetitionCounter = 1U;
    g_foc_tim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_PWM_Init(&g_foc_tim1) != HAL_OK)
    {
        return 0U;
    }

    master.MasterOutputTrigger = TIM_TRGO_OC4REF;
    master.MasterOutputTrigger2 = TIM_TRGO2_RESET;
    master.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&g_foc_tim1, &master) != HAL_OK)
    {
        return 0U;
    }

    break_input.Source = TIM_BREAKINPUTSOURCE_BKIN;
    break_input.Enable = TIM_BREAKINPUTSOURCE_ENABLE;
    break_input.Polarity = TIM_BREAKINPUTSOURCE_POLARITY_LOW;
    if (HAL_TIMEx_ConfigBreakInput(&g_foc_tim1, TIM_BREAKINPUT_BRK2, &break_input) != HAL_OK)
    {
        return 0U;
    }

    output.OCMode = TIM_OCMODE_PWM1;
    output.Pulse = 0U;
    output.OCPolarity = TIM_OCPOLARITY_HIGH;
    output.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    output.OCFastMode = TIM_OCFAST_DISABLE;
    output.OCIdleState = TIM_OCIDLESTATE_RESET;
    output.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    if ((HAL_TIM_PWM_ConfigChannel(&g_foc_tim1, &output, TIM_CHANNEL_1) != HAL_OK) ||
        (HAL_TIM_PWM_ConfigChannel(&g_foc_tim1, &output, TIM_CHANNEL_2) != HAL_OK) ||
        (HAL_TIM_PWM_ConfigChannel(&g_foc_tim1, &output, TIM_CHANNEL_3) != HAL_OK))
    {
        return 0U;
    }

    output.OCMode = TIM_OCMODE_PWM2;
    output.Pulse = FOC_PWM_PERIOD_TICKS - 1U;
    if (HAL_TIM_PWM_ConfigChannel(&g_foc_tim1, &output, TIM_CHANNEL_4) != HAL_OK)
    {
        return 0U;
    }

    break_dead_time.OffStateRunMode = TIM_OSSR_ENABLE;
    break_dead_time.OffStateIDLEMode = TIM_OSSI_ENABLE;
    break_dead_time.LockLevel = TIM_LOCKLEVEL_OFF;
    break_dead_time.DeadTime = 0U;
    break_dead_time.BreakState = TIM_BREAK_DISABLE;
    break_dead_time.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
    break_dead_time.BreakFilter = 0U;
    break_dead_time.BreakAFMode = TIM_BREAK_AFMODE_INPUT;
    break_dead_time.Break2State = TIM_BREAK2_ENABLE;
    break_dead_time.Break2Polarity = TIM_BREAK2POLARITY_HIGH;
    break_dead_time.Break2Filter = 3U;
    break_dead_time.Break2AFMode = TIM_BREAK_AFMODE_INPUT;
    break_dead_time.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
    if (HAL_TIMEx_ConfigBreakDeadTime(&g_foc_tim1, &break_dead_time) != HAL_OK)
    {
        return 0U;
    }

    TIM1->CCR1 = 0U;
    TIM1->CCR2 = 0U;
    TIM1->CCR3 = 0U;
    TIM1->CCER &= ~(TIM_CCER_CC1E | TIM_CCER_CC2E | TIM_CCER_CC3E | TIM_CCER_CC4E);
    TIM1->BDTR &= ~TIM_BDTR_MOE;
    TIM1->CR1 &= ~TIM_CR1_CEN;

    g_foc_diagnostics.pwm_frequency_hz = FOC_PWM_FREQUENCY_HZ;
    g_foc_diagnostics.pwm_period_ticks = FOC_PWM_PERIOD_TICKS;
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_TIM1_CONFIGURED;
    return 1U;
}

static void foc_platform_init_analog_gpio(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    gpio.Mode = GPIO_MODE_ANALOG;
    gpio.Pull = GPIO_NOPULL;

    /* PA0=Vbus, PA1=IU, PA7=IW. */
    gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_7;
    HAL_GPIO_Init(GPIOA, &gpio);
    /* PB11=IV (available to ADC1 and ADC2). */
    gpio.Pin = GPIO_PIN_11;
    HAL_GPIO_Init(GPIOB, &gpio);
    /* PC2=potentiometer, PC4=temperature. */
    gpio.Pin = GPIO_PIN_2 | GPIO_PIN_4;
    HAL_GPIO_Init(GPIOC, &gpio);
}

static void foc_platform_fill_adc_init(ADC_HandleTypeDef *adc, ADC_TypeDef *instance)
{
    adc->Instance = instance;
    adc->Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
    adc->Init.Resolution = ADC_RESOLUTION_12B;
    adc->Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adc->Init.GainCompensation = 0U;
    /* HAL uses ScanConvMode to decide whether injected ranks 2..4 exist. */
    adc->Init.ScanConvMode = ADC_SCAN_ENABLE;
    adc->Init.EOCSelection = ADC_EOC_SEQ_CONV;
    adc->Init.LowPowerAutoWait = DISABLE;
    adc->Init.ContinuousConvMode = DISABLE;
    adc->Init.NbrOfConversion = 1U;
    adc->Init.DiscontinuousConvMode = DISABLE;
    adc->Init.ExternalTrigConv = ADC_SOFTWARE_START;
    adc->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    adc->Init.DMAContinuousRequests = DISABLE;
    adc->Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
    adc->Init.OversamplingMode = DISABLE;
}

