ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
static uint32_t foc_platform_read_adc(ADC_HandleTypeDef *adc,
                                      uint32_t channel,
                                      volatile uint16_t *value)
{
    ADC_ChannelConfTypeDef config = {0};

    config.Channel = channel;
    config.Rank = ADC_REGULAR_RANK_1;
    config.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    config.SingleDiff = ADC_SINGLE_ENDED;
    config.OffsetNumber = ADC_OFFSET_NONE;
    config.Offset = 0U;
    if ((HAL_ADC_ConfigChannel(adc, &config) != HAL_OK) ||
        (HAL_ADC_Start(adc) != HAL_OK) ||
        (HAL_ADC_PollForConversion(adc, FOC_ADC_TIMEOUT_MS) != HAL_OK))
    {
        return 0U;
    }
    *value = (uint16_t)HAL_ADC_GetValue(adc);
    return 1U;
}

static uint32_t foc_platform_sample_monitor_inputs(void)
{
    uint32_t ok = 1U;

    if ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_SYNC_RUNNING) == 0U)
    {
        ok &= foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_2,
                                    &g_foc_diagnostics.phase_u_raw);
        ok &= foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_14,
                                    &g_foc_diagnostics.phase_v_raw);
        ok &= foc_platform_read_adc(&g_foc_adc2, ADC_CHANNEL_4,
                                    &g_foc_diagnostics.phase_w_raw);
    }
    ok &= foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_1,
                                &g_foc_diagnostics.bus_voltage_raw);
    ok &= foc_platform_read_adc(&g_foc_adc2, ADC_CHANNEL_5,
                                &g_foc_diagnostics.temperature_raw);
    ok &= foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_8,
                                &g_foc_diagnostics.potentiometer_raw);
    if (ok == 0U)
    {
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_ADC_READ_ERROR;
    }
    else
    {
        g_foc_diagnostics.flags &= ~FOC_PLATFORM_DIAG_ADC_READ_ERROR;
    }
    return ok;
}

static uint32_t foc_platform_calibrate_current_offsets(void)
{
    uint32_t sample;
    uint32_t sum_u = 0U;
    uint32_t sum_v = 0U;
    uint32_t sum_w = 0U;

    for (sample = 0U; sample < FOC_OFFSET_SAMPLE_COUNT; ++sample)
    {
        if ((foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_2,
                                   &g_foc_diagnostics.phase_u_raw) == 0U) ||
            (foc_platform_read_adc(&g_foc_adc1, ADC_CHANNEL_14,
                                   &g_foc_diagnostics.phase_v_raw) == 0U) ||
            (foc_platform_read_adc(&g_foc_adc2, ADC_CHANNEL_4,
                                   &g_foc_diagnostics.phase_w_raw) == 0U))
        {
            g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_ADC_READ_ERROR;
            return 0U;
        }
        sum_u += g_foc_diagnostics.phase_u_raw;
        sum_v += g_foc_diagnostics.phase_v_raw;
        sum_w += g_foc_diagnostics.phase_w_raw;
    }

    g_foc_diagnostics.phase_u_offset = (uint16_t)(sum_u / FOC_OFFSET_SAMPLE_COUNT);
    g_foc_diagnostics.phase_v_offset = (uint16_t)(sum_v / FOC_OFFSET_SAMPLE_COUNT);
    g_foc_diagnostics.phase_w_offset = (uint16_t)(sum_w / FOC_OFFSET_SAMPLE_COUNT);
    if ((g_foc_diagnostics.phase_u_offset >= FOC_OFFSET_MIN_VALID) &&
        (g_foc_diagnostics.phase_u_offset <= FOC_OFFSET_MAX_VALID) &&
        (g_foc_diagnostics.phase_v_offset >= FOC_OFFSET_MIN_VALID) &&
        (g_foc_diagnostics.phase_v_offset <= FOC_OFFSET_MAX_VALID) &&
        (g_foc_diagnostics.phase_w_offset >= FOC_OFFSET_MIN_VALID) &&
        (g_foc_diagnostics.phase_w_offset <= FOC_OFFSET_MAX_VALID))
    {
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_CURRENT_OFFSETS_VALID;
        return 1U;
    }
    return 0U;
}

static uint32_t foc_platform_configure_injected_adc(void)
{
    ADC_InjectionConfTypeDef injected = {0};

    injected.InjectedSamplingTime = ADC_SAMPLETIME_6CYCLES_5;
    injected.InjectedSingleDiff = ADC_SINGLE_ENDED;
    injected.InjectedOffsetNumber = ADC_OFFSET_NONE;
    injected.InjectedOffset = 0U;
    /* ADC1 IU and ADC2 IV are sampled on the same TIM1 trigger. The third
     * current is reconstructed as -(IU + IV), avoiding the old rank-1/rank-2
     * time skew. */
    injected.InjectedNbrOfConversion = 1U;
    injected.InjectedDiscontinuousConvMode = DISABLE;
    injected.AutoInjectedConv = DISABLE;
    injected.QueueInjectedContext = DISABLE;
    injected.ExternalTrigInjecConv = ADC_EXTERNALTRIGINJEC_T1_TRGO;
    injected.ExternalTrigInjecConvEdge = ADC_EXTERNALTRIGINJECCONV_EDGE_RISING;
    injected.InjecOversamplingMode = DISABLE;

    injected.InjectedChannel = ADC_CHANNEL_2;
    injected.InjectedRank = ADC_INJECTED_RANK_1;
    if (HAL_ADCEx_InjectedConfigChannel(&g_foc_adc1, &injected) != HAL_OK)
    {
        return 0U;
    }
    injected.InjectedChannel = ADC_CHANNEL_14;
    injected.InjectedRank = ADC_INJECTED_RANK_1;
    return (HAL_ADCEx_InjectedConfigChannel(&g_foc_adc2, &injected) == HAL_OK) ? 1U : 0U;
}

static uint32_t foc_platform_start_sync_monitor(void)
{
    g_foc_diagnostics.sync_sample_count = 0U;
    __HAL_ADC_CLEAR_FLAG(&g_foc_adc1, ADC_FLAG_JEOC | ADC_FLAG_JEOS);
    __HAL_ADC_CLEAR_FLAG(&g_foc_adc2, ADC_FLAG_JEOC | ADC_FLAG_JEOS);
    if ((HAL_ADCEx_InjectedStart(&g_foc_adc2) != HAL_OK) ||
        (HAL_ADCEx_InjectedStart_IT(&g_foc_adc1) != HAL_OK))
    {
        return 0U;
    }

    HAL_NVIC_SetPriority(ADC1_2_IRQn, 1U, 0U);
    HAL_NVIC_EnableIRQ(ADC1_2_IRQn);
    HAL_NVIC_SetPriority(TIM1_BRK_TIM15_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM1_BRK_TIM15_IRQn);

    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    TIM1->CCR4 = FOC_PWM_PERIOD_TICKS - 1U;
    TIM1->CCER |= TIM_CCER_CC4E;
    TIM1->CCER &= ~(TIM_CCER_CC1E | TIM_CCER_CC2E | TIM_CCER_CC3E);
    TIM1->BDTR &= ~TIM_BDTR_MOE;
    TIM1->CNT = 0U;
    TIM1->CR1 |= TIM_CR1_CEN;
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_SYNC_RUNNING;
    return 1U;
}

static uint32_t foc_platform_init_adc_monitor(void)
{
    RCC_PeriphCLKInitTypeDef clock = {0};
    ADC_MultiModeTypeDef multimode = {0};

    clock.PeriphClockSelection = RCC_PERIPHCLK_ADC12;
    clock.Adc12ClockSelection = RCC_ADC12CLKSOURCE_PLL;
    if (HAL_RCCEx_PeriphCLKConfig(&clock) != HAL_OK)
    {
        return 0U;
    }

    __HAL_RCC_ADC12_CLK_ENABLE();
    __HAL_RCC_ADC12_FORCE_RESET();
    __HAL_RCC_ADC12_RELEASE_RESET();
    foc_platform_init_analog_gpio();
    foc_platform_fill_adc_init(&g_foc_adc1, ADC1);
    foc_platform_fill_adc_init(&g_foc_adc2, ADC2);
    if ((HAL_ADC_Init(&g_foc_adc1) != HAL_OK) ||
        (HAL_ADC_Init(&g_foc_adc2) != HAL_OK))
    {
        return 0U;
    }

    multimode.Mode = ADC_MODE_INDEPENDENT;
    if (HAL_ADCEx_MultiModeConfigChannel(&g_foc_adc1, &multimode) != HAL_OK)
    {
        return 0U;
    }
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_ADC_CONFIGURED;

    if ((HAL_ADCEx_Calibration_Start(&g_foc_adc1, ADC_SINGLE_ENDED) != HAL_OK) ||
        (HAL_ADCEx_Calibration_Start(&g_foc_adc2, ADC_SINGLE_ENDED) != HAL_OK))
    {
        return 0U;
    }
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_ADC_CALIBRATED;
    (void)foc_platform_calibrate_current_offsets();
    if ((foc_platform_sample_monitor_inputs() == 0U) ||
        (foc_platform_configure_injected_adc() == 0U))
    {
        return 0U;
    }
    return 1U;
}
#endif

foc_status_t foc_platform_init(void)
{
    foc_platform_emergency_stop();
    (void)foc_math_accel_init();
#if defined(FOC_TARGET_STM32G431)
    if ((foc_platform_init_timer_disabled() == 0U) ||
        (foc_platform_init_adc_monitor() == 0U))
    {
        foc_platform_emergency_stop();
        return FOC_STATUS_HARDWARE_FAULT;
    }
    foc_platform_emergency_stop();
    if (foc_platform_start_sync_monitor() == 0U)
    {
        foc_platform_emergency_stop();
        return FOC_STATUS_HARDWARE_FAULT;
    }
    foc_platform_refresh_safety_flags();
    if ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_DRIVER_FAULT) != 0U)
    {
        foc_platform_emergency_stop();
        return FOC_STATUS_HARDWARE_FAULT;
    }
#endif
#if defined(FOC_TARGET_STM32G431)
    return FOC_STATUS_OK;
#else
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

foc_status_t foc_platform_configure(const foc_platform_config_t *config)
{
    if ((config == 0) ||
        (config->struct_size != sizeof(foc_platform_config_t)) ||
        (config->config_version != FOC_PLATFORM_CONFIG_VERSION) ||
        !(config->minimum_bus_voltage_v > 0.0f) ||
        !(config->maximum_bus_voltage_v > config->minimum_bus_voltage_v) ||
        !(config->software_current_trip_a > 0.0f) ||
        !(config->minimum_duty >= 0.0f) ||
        !(config->maximum_duty <= 1.0f) ||
        !(config->maximum_duty > config->minimum_duty) ||
        (config->isr_deadline_cycles == 0U))
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }
#if defined(FOC_TARGET_STM32G431)
    if (g_foc_control_armed != 0U)
    {
        return FOC_STATUS_DISABLED;
    }
#endif
    g_foc_platform_config = *config;
    return FOC_STATUS_OK;
}

foc_status_t foc_platform_bind_controller(foc_rust_context_t *context)
{
#if defined(FOC_TARGET_STM32G431)
    if ((context == 0) ||
        (foc_rust_context_required_size() > sizeof(*context)) ||
        (foc_rust_context_required_align() > _Alignof(foc_rust_context_t)))
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }
    if (g_foc_control_armed != 0U)
    {
        return FOC_STATUS_DISABLED;
    }
    g_foc_controller = context;
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_CONTROLLER_BOUND;
    return FOC_STATUS_OK;
#else
    (void)context;
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

