ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
void foc_platform_emergency_stop(void)
{
#if defined(FOC_TARGET_STM32G431)
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();
    HAL_GPIO_WritePin(FOC_GATE_ENABLE_PORT, FOC_GATE_ENABLE_PINS, GPIO_PIN_RESET);
    gpio.Pin = FOC_GATE_ENABLE_PINS;
    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_PULLDOWN;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(FOC_GATE_ENABLE_PORT, &gpio);
    HAL_GPIO_WritePin(FOC_GATE_ENABLE_PORT, FOC_GATE_ENABLE_PINS, GPIO_PIN_RESET);

    foc_platform_disable_power_fast();
    if ((RCC->APB2ENR & RCC_APB2ENR_TIM1EN) != 0U)
    {
        TIM1->CCER &= ~TIM_CCER_CC4E;
        TIM1->CR1 &= ~TIM_CR1_CEN;
    }
    g_foc_diagnostics.flags &= ~FOC_PLATFORM_DIAG_SYNC_RUNNING;
    foc_platform_refresh_safety_flags();
#endif
}

#if defined(FOC_TARGET_STM32G431)
void ADC1_2_IRQHandler(void)
{
    int32_t current_u_counts;
    int32_t current_v_counts;
    int32_t current_w_counts;
    int32_t phase_w_raw;
    uint16_t delta_u;
    uint16_t delta_v;
    uint16_t delta_w;
    uint16_t peak;
    uint16_t trip_counts;

    if ((ADC1->ISR & ADC_ISR_JEOS) != 0U)
    {
        g_foc_diagnostics.phase_u_raw = (uint16_t)ADC1->JDR1;
        g_foc_diagnostics.phase_v_raw = (uint16_t)ADC2->JDR1;
        current_u_counts = (int32_t)g_foc_diagnostics.phase_u_offset -
                           (int32_t)g_foc_diagnostics.phase_u_raw;
        current_v_counts = (int32_t)g_foc_diagnostics.phase_v_offset -
                           (int32_t)g_foc_diagnostics.phase_v_raw;
        current_w_counts = -current_u_counts - current_v_counts;
        phase_w_raw = (int32_t)g_foc_diagnostics.phase_w_offset - current_w_counts;
        if (phase_w_raw < 0)
        {
            phase_w_raw = 0;
        }
        else if (phase_w_raw > 4095)
        {
            phase_w_raw = 4095;
        }
        g_foc_diagnostics.phase_w_raw = (uint16_t)phase_w_raw;
        ++g_foc_diagnostics.sync_sample_count;
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_SYNC_SAMPLES_VALID;
        if (g_foc_control_armed != 0U)
        {
            uint32_t cycle_start = DWT->CYCCNT;
            uint32_t cycle_count;
            uint32_t control_cycle_start = cycle_start;
            uint32_t control_cycle_end = cycle_start;
            foc_status_t control_status;
            foc_feedback_t feedback;
            foc_output_t output;
            foc_telemetry_t telemetry;

            delta_u = (uint16_t)((current_u_counts < 0) ? -current_u_counts : current_u_counts);
            delta_v = (uint16_t)((current_v_counts < 0) ? -current_v_counts : current_v_counts);
            delta_w = (uint16_t)((current_w_counts < 0) ? -current_w_counts : current_w_counts);
            peak = (delta_u > delta_v) ? delta_u : delta_v;
            peak = (peak > delta_w) ? peak : delta_w;
            if (peak > g_foc_diagnostics.peak_current_delta_counts)
            {
                g_foc_diagnostics.peak_current_delta_counts = peak;
            }
            trip_counts = foc_platform_current_trip_counts();
            if ((peak > trip_counts) ||
                (foc_platform_driver_faulted() != 0U) ||
                (g_foc_controller == 0))
            {
                if (peak > trip_counts)
                {
                    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_CURRENT_TRIP;
                }
                foc_platform_disable_power_fast();
            }
            else
            {
                feedback.phase_current_a = (float)current_u_counts /
                                           FOC_CURRENT_COUNTS_PER_AMP;
                feedback.phase_current_b = (float)current_v_counts /
                                           FOC_CURRENT_COUNTS_PER_AMP;
                feedback.phase_current_c = (float)current_w_counts /
                                           FOC_CURRENT_COUNTS_PER_AMP;
                feedback.dc_bus_voltage =
                    ((float)g_foc_diagnostics.bus_voltage_raw * FOC_ADC_REFERENCE_VOLTAGE) /
                    (FOC_ADC_FULL_SCALE * FOC_BUS_PARTITIONING_FACTOR);
                feedback.electrical_angle_rad = 0.0f;
                control_cycle_start = DWT->CYCCNT;
                control_status = foc_rust_realtime_step(g_foc_controller,
                                                        &feedback,
                                                        &output,
                                                        &telemetry);
                control_cycle_end = DWT->CYCCNT;
                g_foc_diagnostics.last_control_status = control_status;
                if (control_status != FOC_STATUS_OK)
                {
                    g_foc_diagnostics.control_fault_flags =
                        foc_rust_fault_flags(g_foc_controller);
                    g_foc_diagnostics.last_duty_a_per_mille =
                        (uint16_t)(output.duty_a * 1000.0f + 0.5f);
                    g_foc_diagnostics.last_duty_b_per_mille =
                        (uint16_t)(output.duty_b * 1000.0f + 0.5f);
                    g_foc_diagnostics.last_duty_c_per_mille =
                        (uint16_t)(output.duty_c * 1000.0f + 0.5f);
                    ++g_foc_diagnostics.realtime_error_count;
                    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_CONTROL_ERROR;
                    foc_platform_disable_power_fast();
                }
                else if (!(output.duty_a >= g_foc_platform_config.minimum_duty &&
                           output.duty_a <= g_foc_platform_config.maximum_duty) ||
                         !(output.duty_b >= g_foc_platform_config.minimum_duty &&
                           output.duty_b <= g_foc_platform_config.maximum_duty) ||
                         !(output.duty_c >= g_foc_platform_config.minimum_duty &&
                           output.duty_c <= g_foc_platform_config.maximum_duty))
                {
                    g_foc_diagnostics.control_fault_flags =
                        foc_rust_fault_flags(g_foc_controller);
                    g_foc_diagnostics.last_duty_a_per_mille =
                        (uint16_t)(output.duty_a * 1000.0f + 0.5f);
                    g_foc_diagnostics.last_duty_b_per_mille =
                        (uint16_t)(output.duty_b * 1000.0f + 0.5f);
                    g_foc_diagnostics.last_duty_c_per_mille =
                        (uint16_t)(output.duty_c * 1000.0f + 0.5f);
                    ++g_foc_diagnostics.realtime_error_count;
                    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_OUTPUT_REJECTED;
                    foc_platform_disable_power_fast();
                }
                else
                {
                    TIM1->CCR1 = (uint32_t)(output.duty_a * (float)FOC_PWM_PERIOD_TICKS + 0.5f);
                    TIM1->CCR2 = (uint32_t)(output.duty_b * (float)FOC_PWM_PERIOD_TICKS + 0.5f);
                    TIM1->CCR3 = (uint32_t)(output.duty_c * (float)FOC_PWM_PERIOD_TICKS + 0.5f);
                    g_foc_telemetry = telemetry;
                    ++g_foc_diagnostics.realtime_step_count;
                    foc_platform_trace_capture(&feedback, &output, &telemetry);
                }
            }
            cycle_count = DWT->CYCCNT - cycle_start;
            if ((control_cycle_start - cycle_start) >
                g_foc_diagnostics.maximum_precontrol_cycles)
            {
                g_foc_diagnostics.maximum_precontrol_cycles =
                    control_cycle_start - cycle_start;
            }
            if ((control_cycle_end - control_cycle_start) >
                g_foc_diagnostics.maximum_control_cycles)
            {
                g_foc_diagnostics.maximum_control_cycles =
                    control_cycle_end - control_cycle_start;
            }
            if ((DWT->CYCCNT - control_cycle_end) >
                g_foc_diagnostics.maximum_postcontrol_cycles)
            {
                g_foc_diagnostics.maximum_postcontrol_cycles =
                    DWT->CYCCNT - control_cycle_end;
            }
            if (cycle_count > g_foc_diagnostics.maximum_isr_cycles)
            {
                g_foc_diagnostics.maximum_isr_cycles = cycle_count;
            }
            if (cycle_count > g_foc_platform_config.isr_deadline_cycles)
            {
                ++g_foc_diagnostics.deadline_miss_count;
                g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_DEADLINE_MISSED;
                foc_platform_disable_power_fast();
            }
        }
        ADC1->ISR = ADC_ISR_JEOC | ADC_ISR_JEOS;
        ADC2->ISR = ADC_ISR_JEOC | ADC_ISR_JEOS;
    }
}

void TIM1_BRK_TIM15_IRQHandler(void)
{
    if ((TIM1->SR & (TIM_SR_BIF | TIM_SR_B2IF)) != 0U)
    {
        TIM1->SR &= ~(TIM_SR_BIF | TIM_SR_B2IF);
        ++g_foc_diagnostics.break_fault_count;
        g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_BREAK_LATCHED;
        foc_platform_disable_power_fast();
        TIM1->CCER &= ~TIM_CCER_CC4E;
        TIM1->CR1 &= ~TIM_CR1_CEN;
        g_foc_diagnostics.flags &= ~FOC_PLATFORM_DIAG_SYNC_RUNNING;
    }
}
#endif

