ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
foc_status_t foc_platform_read_feedback(foc_feedback_t *feedback)
{
    if (feedback == 0)
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }

    feedback->phase_current_a = 0.0f;
    feedback->phase_current_b = 0.0f;
    feedback->phase_current_c = 0.0f;
    feedback->dc_bus_voltage = 0.0f;
    feedback->electrical_angle_rad = 0.0f;
#if defined(FOC_TARGET_STM32G431)
    if ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_ADC_CONFIGURED) == 0U)
    {
        return FOC_STATUS_NOT_CONFIGURED;
    }
    if ((g_foc_control_armed == 0U) && (foc_platform_sample_monitor_inputs() == 0U))
    {
        return FOC_STATUS_HARDWARE_FAULT;
    }

    /* IHM16M1/MCSDK polarity is offset minus sample. */
    feedback->phase_current_a =
        (float)((int32_t)g_foc_diagnostics.phase_u_offset -
                (int32_t)g_foc_diagnostics.phase_u_raw) / FOC_CURRENT_COUNTS_PER_AMP;
    feedback->phase_current_b =
        (float)((int32_t)g_foc_diagnostics.phase_v_offset -
                (int32_t)g_foc_diagnostics.phase_v_raw) / FOC_CURRENT_COUNTS_PER_AMP;
    feedback->phase_current_c = -feedback->phase_current_a - feedback->phase_current_b;
    feedback->dc_bus_voltage =
        ((float)g_foc_diagnostics.bus_voltage_raw * FOC_ADC_REFERENCE_VOLTAGE) /
        (FOC_ADC_FULL_SCALE * FOC_BUS_PARTITIONING_FACTOR);
    foc_platform_refresh_safety_flags();
    if ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_DRIVER_FAULT) != 0U)
    {
        return FOC_STATUS_HARDWARE_FAULT;
    }
#endif
#if defined(FOC_TARGET_STM32G431)
    return ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_SYNC_SAMPLES_VALID) != 0U) ?
        FOC_STATUS_OK : FOC_STATUS_NOT_CONFIGURED;
#else
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

foc_status_t foc_platform_apply_output(const foc_output_t *output)
{
    if (output == 0)
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }

#if defined(FOC_TARGET_STM32G431)
    if (g_foc_control_armed == 0U)
    {
        return FOC_STATUS_DISABLED;
    }
    if ((foc_platform_driver_faulted() != 0U) ||
        ((g_foc_diagnostics.flags & (FOC_PLATFORM_DIAG_BREAK_LATCHED |
                                     FOC_PLATFORM_DIAG_CURRENT_TRIP |
                                     FOC_PLATFORM_DIAG_ADC_READ_ERROR)) != 0U))
    {
        foc_platform_disable_power_fast();
        foc_platform_refresh_safety_flags();
        return FOC_STATUS_HARDWARE_FAULT;
    }
    /* The comparisons deliberately reject NaN as well as out-of-range duty. */
    if (!(output->duty_a >= g_foc_platform_config.minimum_duty &&
          output->duty_a <= g_foc_platform_config.maximum_duty) ||
        !(output->duty_b >= g_foc_platform_config.minimum_duty &&
          output->duty_b <= g_foc_platform_config.maximum_duty) ||
        !(output->duty_c >= g_foc_platform_config.minimum_duty &&
          output->duty_c <= g_foc_platform_config.maximum_duty))
    {
        foc_platform_disable_power_fast();
        foc_platform_refresh_safety_flags();
        return FOC_STATUS_INVALID_ARGUMENT;
    }

    TIM1->CCR1 = (uint32_t)((output->duty_a * (float)FOC_PWM_PERIOD_TICKS) + 0.5f);
    TIM1->CCR2 = (uint32_t)((output->duty_b * (float)FOC_PWM_PERIOD_TICKS) + 0.5f);
    TIM1->CCR3 = (uint32_t)((output->duty_c * (float)FOC_PWM_PERIOD_TICKS) + 0.5f);
    ++g_foc_diagnostics.trial_apply_count;
    if ((g_foc_control_armed == 0U) || (foc_platform_driver_faulted() != 0U))
    {
        foc_platform_disable_power_fast();
        foc_platform_refresh_safety_flags();
        return FOC_STATUS_HARDWARE_FAULT;
    }
    return FOC_STATUS_OK;
#else
    foc_platform_emergency_stop();
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

foc_status_t foc_platform_control_start(float target_speed_rpm)
{
#if defined(FOC_TARGET_STM32G431)
    uint32_t neutral_ticks;
    uint16_t bus_min_raw;
    uint16_t bus_max_raw;
    foc_feedback_t feedback;
    foc_status_t status;

    if ((g_foc_controller == 0) || (g_foc_control_armed != 0U))
    {
        return FOC_STATUS_NOT_CONFIGURED;
    }
    status = foc_platform_read_feedback(&feedback);
    if (status != FOC_STATUS_OK)
    {
        return status;
    }
    foc_platform_refresh_safety_flags();
    bus_min_raw = foc_platform_bus_voltage_to_raw(g_foc_platform_config.minimum_bus_voltage_v);
    bus_max_raw = foc_platform_bus_voltage_to_raw(g_foc_platform_config.maximum_bus_voltage_v);
    if (((g_foc_diagnostics.flags & FOC_TRIAL_REQUIRED_FLAGS) != FOC_TRIAL_REQUIRED_FLAGS) ||
        ((g_foc_diagnostics.flags & FOC_TRIAL_FORBIDDEN_FLAGS) != 0U) ||
        ((g_foc_diagnostics.flags & FOC_PLATFORM_DIAG_CONTROLLER_BOUND) == 0U) ||
        (g_foc_diagnostics.bus_voltage_raw < bus_min_raw) ||
        (g_foc_diagnostics.bus_voltage_raw > bus_max_raw))
    {
        return FOC_STATUS_NOT_CONFIGURED;
    }
    status = foc_rust_start_realtime(g_foc_controller, 1U, target_speed_rpm);
    if (status != FOC_STATUS_OK)
    {
        return status;
    }

    neutral_ticks = FOC_PWM_PERIOD_TICKS / 2U;
    g_foc_diagnostics.peak_current_delta_counts = 0U;
    g_foc_diagnostics.trial_apply_count = 0U;
    g_foc_diagnostics.realtime_step_count = 0U;
    g_foc_diagnostics.realtime_error_count = 0U;
    g_foc_diagnostics.maximum_isr_cycles = 0U;
    g_foc_diagnostics.maximum_precontrol_cycles = 0U;
    g_foc_diagnostics.maximum_control_cycles = 0U;
    g_foc_diagnostics.maximum_postcontrol_cycles = 0U;
    g_foc_diagnostics.deadline_miss_count = 0U;
    g_foc_diagnostics.last_control_status = FOC_STATUS_OK;
    g_foc_diagnostics.control_fault_flags = 0U;
    g_foc_diagnostics.last_duty_a_per_mille = 500U;
    g_foc_diagnostics.last_duty_b_per_mille = 500U;
    g_foc_diagnostics.last_duty_c_per_mille = 500U;
    g_foc_diagnostics.flags &= ~(FOC_PLATFORM_DIAG_CURRENT_TRIP |
                                 FOC_PLATFORM_DIAG_DEADLINE_MISSED |
                                 FOC_PLATFORM_DIAG_CONTROL_ERROR |
                                 FOC_PLATFORM_DIAG_OUTPUT_REJECTED);
    TIM1->CCR1 = neutral_ticks;
    TIM1->CCR2 = neutral_ticks;
    TIM1->CCR3 = neutral_ticks;
    TIM1->EGR = TIM_EGR_UG;
    TIM1->SR &= ~(TIM_SR_BIF | TIM_SR_B2IF);
    TIM1->DIER |= TIM_DIER_BIE;

    g_foc_control_armed = 1U;
    g_foc_diagnostics.flags |= FOC_PLATFORM_DIAG_TRIAL_ARMED |
                               FOC_PLATFORM_DIAG_REALTIME_ARMED;
    TIM1->CCER |= TIM_CCER_CC1E | TIM_CCER_CC2E | TIM_CCER_CC3E;
    TIM1->BDTR |= TIM_BDTR_MOE;
    FOC_GATE_ENABLE_PORT->BSRR = FOC_GATE_ENABLE_PINS;
    if ((g_foc_control_armed == 0U) || (foc_platform_driver_faulted() != 0U))
    {
        foc_platform_disable_power_fast();
        foc_rust_stop(g_foc_controller);
        foc_platform_refresh_safety_flags();
        return FOC_STATUS_HARDWARE_FAULT;
    }
    foc_platform_refresh_safety_flags();
    return FOC_STATUS_OK;
#else
    (void)target_speed_rpm;
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

void foc_platform_control_stop(void)
{
#if defined(FOC_TARGET_STM32G431)
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    foc_platform_disable_power_fast();
    if (g_foc_controller != 0)
    {
        foc_rust_stop(g_foc_controller);
    }
    if (primask == 0U)
    {
        __enable_irq();
    }
    foc_platform_refresh_safety_flags();
#endif
}

foc_status_t foc_platform_trial_arm(void)
{
    return foc_platform_control_start(582.0f);
}

