ice-infinite/FluxRT/foc/platform/stm32g431/foc_platform_stm32g431.c
void foc_platform_trial_disarm(void)
{
#if defined(FOC_TARGET_STM32G431)
    foc_platform_control_stop();
#endif
}

foc_status_t foc_platform_get_telemetry(foc_telemetry_t *telemetry)
{
    if (telemetry == 0)
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }
#if defined(FOC_TARGET_STM32G431)
    {
        uint32_t primask = __get_PRIMASK();
        __disable_irq();
        *telemetry = g_foc_telemetry;
        if (primask == 0U)
        {
            __enable_irq();
        }
    }
#else
    {
        foc_telemetry_t empty = {0};
        *telemetry = empty;
    }
#endif
    return FOC_STATUS_OK;
}

foc_status_t foc_platform_trace_start(uint32_t sample_divider)
{
#if defined(FOC_TARGET_STM32G431)
    uint32_t primask;
    if (sample_divider < FOC_TRACE_MIN_DIVIDER)
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }
    primask = __get_PRIMASK();
    __disable_irq();
    g_foc_trace_head = 0U;
    g_foc_trace_tail = 0U;
    g_foc_trace_counter = 0U;
    g_foc_trace_dropped_count = 0U;
    g_foc_trace_divider = sample_divider;
    g_foc_trace_enabled = 1U;
    if (primask == 0U)
    {
        __enable_irq();
    }
    return FOC_STATUS_OK;
#else
    (void)sample_divider;
    return FOC_STATUS_NOT_CONFIGURED;
#endif
}

void foc_platform_trace_stop(void)
{
#if defined(FOC_TARGET_STM32G431)
    g_foc_trace_enabled = 0U;
#endif
}

uint32_t foc_platform_trace_is_enabled(void)
{
#if defined(FOC_TARGET_STM32G431)
    return g_foc_trace_enabled;
#else
    return 0U;
#endif
}

uint32_t foc_platform_trace_pop(foc_trace_sample_t *sample)
{
#if defined(FOC_TARGET_STM32G431)
    uint32_t primask;
    uint32_t tail;
    if (sample == 0)
    {
        return 0U;
    }
    primask = __get_PRIMASK();
    __disable_irq();
    tail = g_foc_trace_tail;
    if (tail == g_foc_trace_head)
    {
        if (primask == 0U)
        {
            __enable_irq();
        }
        return 0U;
    }
    *sample = g_foc_trace_buffer[tail];
    g_foc_trace_tail = (tail + 1U) & (FOC_TRACE_CAPACITY - 1U);
    if (primask == 0U)
    {
        __enable_irq();
    }
    return 1U;
#else
    (void)sample;
    return 0U;
#endif
}

uint32_t foc_platform_trace_dropped(void)
{
#if defined(FOC_TARGET_STM32G431)
    return g_foc_trace_dropped_count;
#else
    return 0U;
#endif
}

foc_status_t foc_platform_get_diagnostics(foc_platform_diagnostics_t *diagnostics)
{
    if (diagnostics == 0)
    {
        return FOC_STATUS_INVALID_ARGUMENT;
    }
#if defined(FOC_TARGET_STM32G431)
    foc_platform_refresh_safety_flags();
    *diagnostics = g_foc_diagnostics;
#else
    {
        foc_platform_diagnostics_t empty = {0};
        *diagnostics = empty;
    }
#endif
    return FOC_STATUS_OK;
}
